app/views/movies/index.html.haml

    %tr
      %th#title_header{:class => ("hilite" if params[:sort].include?"title")}= link_to "Movie Title",movies_path({:sort => :title})
---
SELECT "movies".* FROM "movies" ORDER BY release_date