app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1' LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'ratings' LIMIT 1
SELECT "movies"."rating" FROM "movies"
---
  def index
    identify_ratings
    if params.include?(:sort)
      @movies = Movie.order(params[:sort])
      session[:sort] = params[:sort]
    elsif params.include?(:ratings)
      @movies = Movie.find_all_by_rating(params[:ratings].keys)
      session[:ratings] = params[:ratings]
    else
      @movies = Movie.all